In [8]:
import sqlite3 as sql

In [9]:
conn = sql.connect("dw_mp1.db")

In [10]:
cursor = conn.cursor()

In [11]:
import pandas as pd

In [12]:
df_db = pd.read_sql_query('SELECT * FROM sales', conn)
df_db
#Angelo Louis L. Hizon

,Product_ID,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country
0,10000,1/1/09 4:24,Product3,7500,Amex,Pamela,Skaneateles,NY,United States
1,10001,1/8/09 11:55,Product1,1200,Diners,julie,Haverhill,England,United Kingdom
2,10002,1/12/09 21:30,Product1,1200,Visa,Julia,Madison,WI,United States

In [13]:
sales_information = [(10003,'1/26/09 13:41','Product1',1200,'Mastercard','Lesleigh','Baden','Aargau','Switzerland'),
                  (10004,'1/20/09 10:42','Product2',3600,'Diners','esther','Huddersfield','England','United Kingdom'),
                  (10005,'1/22/09 14:25','Product1',1200,'Visa','Hans-Joerg','Belfast','Northern Ireland','United Kingdom'),
                  (10006,'1/28/09 5:36','Product2',3600,'Visa','Christiane','Black River','Black River','Mauritius')]
#Angelo Louis L. Hizon

In [14]:
cursor.executemany("INSERT INTO sales VALUES(?, ?, ?, ?, ?, ?, ?, ? ,?)", sales_information)

In [15]:
conn.commit()

In [ ]:
cursor.execute("SELECT * FROM sales LIMIT 4")
list = cursor.fetchall()

In [ ]:
for sales in list:
    print(sales[0], '-', sales[1], '-', sales[2], '-', sales[3], '-', sales[4], '-', sales[5], '-', sales[6], '-', 
          sales[7], '-', sales[8])
#Angelo Louis L. Hizon

In [ ]:
cursor.execute("SELECT * FROM sales")
list = cursor.fetchall()

In [ ]:
for sales in list:
    print(sales[0], '-', sales[1], '-', sales[2], '-', sales[3], '-', sales[4], '-', sales[5], '-', sales[6], '-', 
          sales[7], '-', sales[8])
#Angelo Louis L. Hizon

In [ ]:
cursor.execute("SELECT Name, City FROM sales")
list = cursor.fetchall()

In [ ]:
for sales in list:
    print(sales[0], '-' , sales[1])
#Angelo Louis L. Hizon

In [ ]:
cursor.execute("SELECT Product, Payment_Type FROM sales WHERE price < 3000")
list = cursor.fetchall()

In [ ]:
for sales in list:
    print(sales[0], '-' , sales[1])
#Angelo Louis L. Hizon

In [5]:
df_csv = pd.read_csv('Sales - Sales.csv')
df_csv

,Product_ID,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country
0,10007,01/02/2009 6:17,Product1,1200,Mastercard,carolina,Basildon,England,United Kingdom
1,10008,01/02/2009 4:53,Product1,1200,Visa,Betina,Parkville,MO,United States
2,10009,01/02/2009 13:08,Product1,1200,Mastercard,Federica e Andrea,Astoria,OR,United States
3,10010,01/03/2009 14:44,Product1,1200,Visa,Gouya,Echuca,Victoria,Australia
4,10011,01/04/2009 12:56,Product2,3600,Visa,Gerd W,Cahaba Heights,AL,United States
...,...,...,...,...,...,...,...,...,...
986,10993,01/07/2009 17:48,Product1,1200,Mastercard,Alex,Augusta,GA,United States
987,10994,1/23/09 12:42,Product2,3600,Mastercard,Anke,Avalon,New South Wales,Australia
988,10995,01/07/2009 19:48,Product2,3600,Mastercard,TRICIA,Sydney,New South Wales,Australia
989,10996,1/26/09 11:19,Product1,1200,Mastercard,smith,Lahti,Etela-Suomen Laani,Finland
990,10997,01/05/2009 13:23,Product1,1200,Visa,Macy,Inner City,Vienna,Austria

In [6]:
df_csv.to_sql(name = 'sales', con = conn, index = False, if_exists = 'append')

IntegrityError: UNIQUE constraint failed: sales.Product_ID

In [ ]:
cursor.execute("SELECT * FROM sales WHERE Product_ID BETWEEN 10000 AND 10009")

In [ ]:
cursor.fetchall()

In [7]:
df_db = pd.read_sql_query("SELECT * FROM sales", conn)
df_db
#Angelo Louis L. Hizon

,Product_ID,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country
0,10000,1/1/09 4:24,Product3,7500,Amex,Pamela,Skaneateles,NY,United States
1,10001,1/8/09 11:55,Product1,1200,Diners,julie,Haverhill,England,United Kingdom
2,10002,1/12/09 21:30,Product1,1200,Visa,Julia,Madison,WI,United States
3,10003,1/26/09 13:41,Product1,1200,Mastercard,Lesleigh,Baden,Aargau,Switzerland
4,10004,1/20/09 10:42,Product2,3600,Diners,esther,Huddersfield,England,United Kingdom
...,...,...,...,...,...,...,...,...,...
993,10993,01/07/2009 17:48,Product1,1200,Mastercard,Alex,Augusta,GA,United States
994,10994,1/23/09 12:42,Product2,3600,Mastercard,Anke,Avalon,New South Wales,Australia
995,10995,01/07/2009 19:48,Product2,3600,Mastercard,TRICIA,Sydney,New South Wales,Australia
996,10996,1/26/09 11:19,Product1,1200,Mastercard,smith,Lahti,Etela-Suomen Laani,Finland
997,10997,01/05/2009 13:23,Product1,1200,Visa,Macy,Inner City,Vienna,Austria

In [ ]:
cursor.execute("SELECT * FROM sales")
list = cursor.fetchmany(10)

In [ ]:
for sales in list:
    print(sales[0], '-', sales[1], '-', sales[2], '-', sales[3], '-', sales[4], '-', sales[5], '-', sales[6], '-', 
          sales[7], '-', sales[8])

In [ ]:
for sales in list:
    print(sales[5], '-', sales[8])

In [ ]:
cursor.execute("SELECT * FROM sales WHERE price > 4000")
list = cursor.fetchmany(10)

In [ ]:
for sales in list:
    print(sales[2], '-', sales[4])

In [ ]:
cursor.execute("SELECT Name, Country FROM sales WHERE Product_ID BETWEEN 10000 AND 10009")

In [ ]:
cursor.fetchall()

In [ ]:
cursor.execute("SELECT Product, Payment_Type FROM sales WHERE Price > 4000")

In [ ]:
cursor.fetchall()

In [ ]:
df_csv.shape 
#Angelo Louis L. Hizon

In [ ]:
cursor.execute(DELETE FROM sales WHERE Product_ID > 10006)